<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	<h1>el, jstl</h1>
	<h2>el</h2>
	<h3>연산자</h3>
	<h4>산술</h4>
	\${5+2 }->${5+2 }<br>
	\${5-2 }->${5-2 }<br>
	\${5*2 }->${5*2 }<br>
	
	\${5/2 }->${5/2 }<br>
	\${5 div 2 }->${5 div 2 }<br>
	
	\${5%2 }->${5%2 }<br>
	\${5 mod 2 }->${5 mod 2 }<br>
	
	<h4>관계형</h4>
	\${5<2 }->${5<2 }<br>
	\${5 lt 2 }->${5 lt 2 }<br>
	
	\${5>2 }->${5>2 }<br>
	\${5 gt 2 }->${5 gt 2 }<br>
	
	\${5==2 }->${5==2 }<br>
	\${5 eq 2 }->${5 eq 2 }<br>
	
	\${5!=2 }->${5!=2 }<br>
	\${5 ne 2 }->${5 ne 2 }<br>
	
	\${5<=2 }->${5<=2 }<br>
	\${5 le 2 }->${5 le 2 }<br>
	
	\${5>=2 }->${5>=2 }<br>
	\${5 ge 2 }->${5 ge 2 }<br>
	
	<h4>조건</h4>
	\${5>=2 ? 5 : 2 }->${5>=2 ? 5 : 2 }<br>
	\${5<=2 ? 5 : 2 }->${5<=2 ? 5 : 2 }<br>
	
	<h4>논리</h4>
	\${ (5>2) && (2<10) }->${ (5>2) && (2<10) }<br>
	\${ (5>2) && (2>10) }->${ (5>2) && (2>10) }<br>
	\${ (5>2) || (2>10) }->${ (5>2) || (2>10) }<br>
	
	\${ !(5>2) }->${ !(5>2) }<br>
	\${str }->${str }<br>
	\${empty str }->${empty str }<br> <!-- str == null ? -->
	\${reqVal}->${reqVal}<br> <!-- 서블릿에서 Attribute로 값이 들어가있음 -->
	
	\${5 }+\${2 }->${5 }+${2 } <!-- 계산하려면 한 괄호 안에 있어야함 -->
	
	
	
</body>
</html>